In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
username = 'root'
password = 'test'


conn = f'mysql+pymysql://{username}:{password}@localhost/Chinook'
    
engine = create_engine(conn)

engine

Engine(mysql+pymysql://root:***@localhost/Chinook)

![png](ERD.png)

In [3]:
conn

'mysql+pymysql://root:test@localhost/Chinook'

In [5]:
q = """
SHOW TABLES
"""

pd.read_sql(q, engine)

   Tables_in_Chinook
0              Album
1             Artist
2           Customer
3           Employee
4              Genre
5            Invoice
6        InvoiceLine
7          MediaType
8           Playlist
9      PlaylistTrack
10             Track

In [9]:
q = """
SELECT customerid, max(Total) AS most_purchase FROM Invoice
GROUP BY customerid
ORDER BY most_purchase DESC
LIMIT 1
"""

pd.read_sql(q, engine)

   customerid  most_purchase
0           6          25.86

In [11]:
q = """
SELECT i.customerid, i.Total, c.Country AS most_purchase 
FROM Invoice AS i
JOIN Customer c ON c.customerId = i.CustomerId
ORDER BY i.Total DESC
LIMIT 1
"""

pd.read_sql(q, engine)

   customerid  Total   most_purchase
0           6  25.86  Czech Republic